# St7SetPropertyName

Sets the name of the specified property.

long St7SetPropertyName(long uID, long Entity, long PropNum, char* PropName)
Input Parameters
uID
Strand7 model file ID.
Entity
One of ptBEAMPROP, ptPLATEPROP, ptBRICKPROP or ptPLYPROP.
PropNum
Property number.
PropName
Name of the property.